Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: reflect on, and develop, own professional practice as a cyber engineer and leader in teams and in a interdisciplinary context, as well as adapting one's own professional practice to the current work situation.
nb: reflektere over, og utvikle, egen faglig utøvelse som cyberingeniør og leder i team og i en tverrfaglig sammenheng, samt tilpasse egen faglig utøvelse til den aktuelle arbeidssituasjon.

source: In topic 2, the exercise “Operational Team Development" is carried out, which aims to increase the cadets’ self-awareness and knowledge of group and team development, including developing a greater insight into the role of the leader.
nb: I tema 2 gjennomføres øvelse «Operativ teamutvikling» som har til hensikt å øke kadettens selvbevissthet og kunnskap om gruppe- og teamutvikling, herunder utvikle større innsikt i lederrollen.

source: There is a progression from exercise 1 to exercise 7.
nb: Det er progresjon fra øving 1 til øving 7.

source: The subject sets out to mobilise the use of theory, experience transference and practical training in military air force power applications, decision making and the operational command of military air force platoons.
nb: Temaet skal legge til rette for bruk av teori, erfaringsoverføring og praktisk trening i luftmilitær maktanvendelse, beslutningstaking og operativ ledelse av luftmilitære avdelinger.

source: Engine and propeller dimensioning for a given ship.
nb: Dimensjonering av motor og propell til gitt skip.

source: Explain defence, environmental, health and financial consequences of products and solutions in the electronics, computer and weapon technology area in the Navy and place these in an ethical perspective and a life cycle perspective.
nb: forklare forsvarsmessige, miljømessige, helsemessige, og økonomiske konsekvenser av produkter og løsninger innenfor elektronikk-, data- og våpenteknikkområdet i Sjøforsvaret og kan sette disse i et etisk perspektiv og et livsløpsperspektiv.

source: Centrifugal pumps, dimensioning, system curves, operational characteristics, control and regulation.
nb: Sentrifugalpumper, dimensjonering, systemkurver, driftskarakteristikker, kontroll og regulering.

source: convey knowledge of computer networks and operating systems
nb: formidle kunnskap om datanettverk og operativsystemer

source: In all periods, compulsory learning in English and Military Sports and Training (MIT) is carried out parallel to, and integrated within, the course.
nb: I alle perioder gjennomføres obligatorisk undervisning i engelsk og militær idrett og trening (MIT) parallelt og integrert med emnet.

source: Autopilot and track control will be taught.
nb: Autopilot og banestyring blir lært.

source: The cadet will continue to develop their competence as an officer also in the act of being an officer.
nb: Kadetten skal fortsette å utvikle sin offiserskompetanse også i offisersgjerningen.

source: Introduction to air power theory, including a basic knowledge of the possibilities and limitations of air power, key concepts and the current national doctrine.
nb: Innføring i luftmaktsteori, herunder grunnleggende kunnskap om luftmaktens muligheter og begrensninger, sentrale begreper og gjeldende nasjonal doktrine.

source: Tutoring of the master's thesis is mandatory, and the students enter into a written, binding supervision agreement with the tutor and FHS.
nb: Det er obligatorisk med veiledning av masteroppgaven, og studentene inngår en skriftlig, forpliktende veiledningsavtale med veileder og FHS.

source: The proposal shall contain (a) headline, (b) candidate's name, (c) overall description of the topic, (d) statement of the problem, (e) description of the nautical subject areas, or alternatively, the marine military operation’s relevance, (f) suggestions for academic supervisors and other relevant contacts and (g) a short list of literature considered relevant to the thesis.
nb: Forslaget skal inneholde (a) overskrift, (b) navn på kandidat, (c) overordnet beskrivelse av emnet, (d) problemstilling, (e) synliggjøring av relasjon til nautisk fagområde sekundært sjømilitær operasjon, (f) forslag til faglig veileder og andre kontaktpersoner og (g) en kort liste over litteratur som anses relevant for oppgaven.

source: dimension centrifugal pump for a given system.
nb: dimensjonere sentrifugalpumpe for et gitt system.

source: operating, maintaining, planning and disposing of relevant weapon technology equipment in the Navy.
nb: drifte, vedlikeholde, prosjektere og avhende relevant våpenteknisk materiell i Sjøforsvaret.

source: The study uses various forms of assessment, both written and oral exams, and assessments related to practice arenas.
nb: Studiet benytter ulike vurderingsformer, både skriftlige og muntlige eksamener, og vurderinger knyttet til praksisarenaer.

source: • describe the rationale and principles for the development and application of information and communication technology in military operations
nb: • beskrive rasjonale og prinsipper for utvikling og anvendelse av informasjons- og kommunikasjonsteknologi i militære operasjoner

source: Apply relevant tactics and conflict techniques for your combat or combat support arms for the mission resolution and command of conflict operations.
nb: · Analysere og planlegge eget oppdrag, skape situasjonsforståelse og ta hensiktsmessige beslutninger i løsning av oppdrag.

source: Lectures, compulsory Octave assignment and compulsory exercises
nb: Forelesninger, obligatorisk Octave-oppgave og obligatoriske øvinger

source: Symbols and Abbreviations in Norwegian Charts
nb: Symboler og forkortelser i norske sjøkart

source: The course is coordinated with workshop practical training/periodic voyages and the courses Marine Propulsion Machinery, Marine Turbomachinery, Mechanical Design/Construction and Material Engineering Science as well as Marine Machinery Systems and Survivability.
nb: Emnet koordineres med verkstedopplæringen/seilasperioder og emnene Marint framdriftsmaskineri, Marine turbomaskiner, Maskinkonstruksjon og materilallære samt Maritime maskinerisystemer og overlevelsesevne.

source: Architectural work, service orientation and taxonomy for consultation, command and control (NATO C3 Taxonomy)
nb: Arkitekturarbeid, tjenesteorientering og taksonomi for konsultasjon, kommando og kontroll (NATO C3 Taxonomy)

source: The officer's role and responsibilities at their level in the RNAF (Air Defence, Mission Support, Force Protection, Control & Alert, Technical)
nb: offiserens rolle og ansvar innenfor sin bransje i Luftforsvaret (luftvern, Mission Support, Force Protection, kontroll & varsling, teknisk)

source: summarise the composition of machine parts to machines.
nb: gjengi sammensetning av maskindeler til maskiner.

source: Plan and conduct physical tests and tests of individual skills ahead of deployment to international operations
nb: planlegge og gjennomføre fysiske tester og test av enkeltmannsferdigheter forut for deployering til internasjonale operasjoner

source: to provide the cadets with basic military skills in winter conditions in line with the practice from the Norwegian Armed Forces Winter Warfare School and the requirements of the NATO Winter Survival Course (NWSC).
nb: gi kadettene grunnleggende militære ferdigheter under vinterforhold i tråd med praksis fra Forsvarets Vinterskole og kravene for NATO Winter Survival Course (NWSC).

source: explain the key concepts and theories of the air power.
nb: forklare luftmaktens sentrale begreper og teorier.

source: Signal processing: Introduction with topics such as discretization, filtering and examples of use of digital signal processing.
nb: Innledning med emner som diskretisering, filtrering og eksempler på bruk av digital signalbehandling.

source: , et compendium describing the whole curriculum in physics.
nb: , et kompendium som beskriver hele fysikkpensumet.

source: Part 2: Overview and knowledge of new technologies that are used increasingly and that in the future will affect the service onboard in the operation room, are important.
nb: Del 2: Oversikt og kunnskap om ny teknologi som blir tatt stadig mer i bruk og som kommer til å påvirke tjenesten om bord i operasjonsrom i framtiden, er viktig.

source: provide details of basic phenomena and practical applications in electro-optics and microwaves (waveguide and radar)
nb: gjøre rede for grunnleggende fenomen og praktiske anvendelser i elektrooptikk og mikrobølger (bølgeleder og radar)

source: • explain with own words how one transmits a signal and how one receives it, in an efficient and robust manner
nb: • forklare med egne ord hvordan man sender et signal og hvordan man mottar det, på en effektiv og robust måte

source: Self-selected literature must directly address the learning outcomes of the FOPS courses and must be approved by the course coordinator before the end of FOPS 2 (work requirement 2).
nb: Selvvalgt litteratur skal direkte adressere FOPS-emnenes læringsutbytter og skal være godkjent av emneansvarlig før avslutningen av FOPS 2 (arbeidskrav 2).

source: The scope, number and form of work requirements vary between subjects.
nb: Omfang, antall og form på arbeidskrav varierer mellom emnene.

source: Combustion chamber constructions for diesel engines and boilers.
nb: Brennkammerkonstruksjoner for dieselmotorer og kjeler.

source: • find academic issues, discuss these, document, protect and present their work orally and in writing
nb: • finne faglige problemstillinger, diskutere disse, dokumentere, beskytte og presentere sitt arbeid muntlig og skriftlig

source: Selected applications, platforms, network components and security mechanisms used by the Norwegian Armed Forces
nb: Utvalgte applikasjoner, plattformer, nettverkskomponenter og sikkerhetsmekanismer brukt i Forsvaret

source: • document trials and experiments with records and technical report in compliance with norm
nb: • dokumentere forsøk og eksperimenter med journal og teknisk rapport i henhold til norm

source: the ability to exchange views and experiences with others within the area of navigation and through this contribute to the development of good practice
nb: kan offiseren utveksle synspunkter og erfaringer med andre med bakgrunn innenfor navigasjon og gjennom dette bidra til utvikling av god praksis

source: • refer to calculations as a basis for budgeting
nb: • referere til kalkyler som grunnlag for budsjettering

source: Section 3 addresses the Norwegian Armed Forces as an instrument for security policy and discusses Norwegian security policy from the Cold War to the present day.
nb: Del 3 tar for seg Forsvaret som sikkerhetspolitisk instrument og omhandler norsk sikkerhetspolitikk fra den Kalde krigen og fram til i dag.

source: The purpose of the course is to reflect on the total learning process in the bachelor program, and translate this into an action plan for the exercise of one's own leadership philosophy in the Air Force.
nb: Hensikten med emnet er å reflektere over den totale læringsprosessen i GOU, og omsette dette til en handlingsplan for utøvelse av egen lederfilosofi i Luftforsvaret.

source: The exercise will also be an arena for training basic military skills, in addition to challenging the physical, mental and relational hardiness of the cadets – both as an individual and as a leader.
nb: Øvelsen skal også være en arena for å trene grunnleggende militære ferdigheter, samt utfordre kadettenes fysiske, mentale og relasjonelle robusthet – både som individ og leder.

source: be able to plan and ensure the safe loading, stowage, securing and caring for cargo during a voyage as well as while unloading the cargo.
nb: kunne planlegge samt sørge for trygg lasting, stuing og sikring, omsorg for lasten under reisen og lossing av lasten.

source: The subject focuses on practical planning, management and implementation at the tactical level.
nb: Temaet fokuserer på praktisk planlegging, ledelse og gjennomføring på taktisk nivå.

source: Decoders, multiplexers and encoders.
nb: Dekodere, multipleksere og enkodere.

source: Theoretical parts of the course use adapted pedagogical teaching arrangements, including self-study, colloquium groups, ordinary and digital lectures, as well as seminar teaching.
nb: Teoretiske deler av emnet anvender tilpassede pedagogiske undervisningsopplegg, herunder blant annet egenstudier, kollokviegrupper, ordinære og digitale forelesninger, samt seminarundervisning.

source: The course's first topic (1 week) deals with the phenomenon of joint operations (
nb: Emnets første tema (1 uke) behandler fenomenet fellesoperasjoner (

source: The master’s thesis should be delivered electronically in PDF format.
nb: Masteroppgaven skal leveres elektronisk i PDF-format.

source: Any resit as a result of failing the overall grade is a 5 hour written examination that makes up 100% of the grade.
nb: Eventuell kontinuasjon som følge av stryk på totalkarakteren, er 5 timers skriftlig eksamen som teller 100% av karakteren.

source: The study at CISK is further subject to the Regulations for Admission, Studies and Examinations at the Norwegian Defence University College.
nb: Videre er studiet ved CISK underlagt forskrift om opptak, studier og eksamen ved Forsvarets høgskole.

source: • manipulate integers at the bit level
nb: • manipulere hele tall på bit-nivå

source: • Line integrals and work, surface integrals and flux
nb: • Linjeintegraler og arbeid, flateintegraler og fluks

source: Account for starting and implementing professional assessment and analysis work, individually or in cooperation with others.
nb: Gjøre rede for oppstart og gjennomføring av et faglig utrednings- og analysearbeid, individuelt eller i samarbeid med andre.

source: apply a relevant system of concepts and formulae
nb: benytte et relevant begreps- og formelapparat

source: Dimensioning principles, yield hypotheses, buckling, fatigue, creep and crack growth.
nb: Dimensjoneringsprinsipper, flythypoteser, knekking, utmatting, siging og sprekkvekst.

source: analyse two-dimensional static and dynamic strains on machine parts.
nb: analysere to-dimensjonale statiske og dynamiske belastninger på maskindeler.

source: • Types of costs and models for budgeting
nb: • Kostnadsteori og modeller for budsjettering

source: Pages: 100 (to be completed before the course start) Mandatory coursework
nb: Antall sider: 100 (kompletteres før emne start)

source: Identify relevant Norwegian, NATO and international standards and manuals which relate to geotechnical elements in military operations and infrastructure.
nb: Kjenne til relevante norske -, NATO - og internasjonale standarder, og håndbøker knyttet til geotekniske forhold i forbindelse med militære operasjoner og infrastruktur.

source: can carry out development, quality assurance and realisation of sustainable products, systems and solutions, to the benefit of the Norwegian Armed Forces and society.
nb: kan gjennomføre utvikling, kvalitetssikring og realisering av bærekraftige produkter, systemer og løsninger, til Forsvarets og samfunnets nytte.

source: Explain legal and ethical justifications for weapons that are prohibited, partially banned and controversial.
nb: forklare rettslige og etiske begrunnelser for forbudte, delvis forbudte og omdiskuterte våpen.

source: Exercise credible and resilient command, solving tactical and managerial challenges, and adapting leadership in the face of demanding conditions in conflicts.
nb: · Anvende situasjonstilpasset og balansert ledelse, og være troverdig og robust i lederrollen, under fysisk og mentalt krevende forhold for å løse oppdrag.

source: The course should be able to appeal to those who want an introduction to geographical information systems (GIS) put in a military context.
nb: Emnet skal kunne appellere til de som ønsker en innføring i geografiske informasjonssystemer (GIS) satt i en militær sammenheng.

source: Section 2 provides an introduction to how military air operations are planned and managed at the operational / tactical level.
nb: Tema 2 gir en innføring i hvordan luftmilitære operasjoner planlegges og ledes på operasjonelt/taktisk nivå.

source: Case studies in groups: MONUSCO & UNMISS (2013-2015)
nb: Case-studier/gruppearbeid: MONUSCO og UNMISS (2013-2015)

source: Lectures, mid-way evaluation and compulsory exercises.
nb: Forelesninger, midtveisevaluering og obligatorisk øving.

source: reason systematically and solve problems related to a naval vessels' stability, conditions in relation to strength, movements and the energy demand for propulsion
nb: resonnere systematisk og løse problemer knyttet til marinefartøyers stabilitet, styrkemessige forhold, bevegelser og energibehovet til framdrift

source: apply correct principles and techniques in order to safeguard and develop their physical form and capabilities.
nb: være i stand til å anvende riktige prinsipper og teknikker for å ivareta og utvikle sin fysiske form og yteevne.

source: Dietlefsen: chapter E. Øi: Trigonometry and navigation formulas
nb: kjennskap til rapporteringsregimer og overvåkningssystem

source: Dimension new roads with the use of relevant digital tools.
nb: Dimensjonere nye veier med bruk av relevant digitalt verktøy.

source: You will then be sent to check out on the F-35 at Luke Air Force Base in Arizona.
nb: Deretter sendes man til utsjekk på F-35 ved Luke Air Force Base i Arizona.

source: The course will provide the student with basic knowledge and skills related to the field of geomatics, with emphasis on the use of GIS in a military context.
nb: Emnet skal gi studenten grunnleggende kunnskaper og ferdigheter knyttet til faget geomatikk, med hovedvekt på bruk av GIS i en militær kontekst.

source: Part 1: Good knowledge of computer systems is important for service on board the Navy’s vessels and in the Navy’s organisation.
nb: Del 1: Gode kunnskaper om datasystemer er viktig for tjenesten om bord på Sjøforsvarets fartøyer og i Sjøforsvarets organisasjon.

source: These courses will follow FHS’s/CISK’s course descriptions and the regulations relating to admission, studies and examinations at the Norwegian Defence University College.
nb: Disse emnene vil følge FHS/CISK sine emnebeskrivelser og forskrift om opptak, studier og eksamen ved Forsvarets høgskole.

source: Lectures, compulsory Matlab assignment, compulsory exercises and presentation with hearing.
nb: Forelesninger, obligatorisk Matlab-oppgave, obligatoriske øvinger og presentasjon med høring.

source: discuss the significance of various frameworks for the use of Norwegian forces in operations abroad and at home, with an emphasis on the frameworks for the role of the Norwegian Armed Forces within national preparation and the alliance.
nb: drøfte betydningen av ulike rammer for bruk av norske styrker i operasjoner ute og hjemme, med vekt på rammer for Forsvarets rolle i nasjonal beredskap og krisehåndtering inkludert totalforsvaret og alliert samarbeid.

source: Chapter 1.1.3 Electronic systems of position fixing and navigation
nb: Kapittel 1.1.3 Elektroniske navigasjons- og posisjoneringssystemer

source: contribute to solving theoretical, technical and practical issues related to the running and operation of Navy vessels and master and use existing technology in the Navy
nb: Bidra til å løse teoretiske, tekniske og praktiske problemstillinger knyttet til operasjon og drift av Sjøforsvarets fartøyer og beherske og anvende eksisterende teknologi i Sjøforsvaret

source: External and internal factors’ significance, simulations and laboratory exercise.
nb: Ytre og indre faktorers betydning, simuleringer og laboratorieøvelse.

source: • calculate magnetic flux and induced currents for practical applications
nb: • beregne magnetfluks og indusert strøm for praktiske anvendelser

source: If the total grade is failed, continuation will be a 5-hour exam that covers everything that is included in the assessment basis.
nb: Hvis stryk på totalkarakteren, vil kontinuasjon være en 5 timers eksamen som dekker alt som inngår i vurderingsgrunnlaget.

source: Identify, plan and conduct engineering projects, work assignments, tests and experiments, both independently and in teams.
nb: Identifisere, planlegge og gjennomføre ingeniørfaglige prosjekter, arbeidsoppgaver, forsøk og eksperimenter både selvstendig og i team.

source: Selected parts of the Norwegian Armed Forces' information infrastructure (II) are used as a reference.
nb: Utvalgte deler av Forsvarets informasjonsinfrastruktur (INI) brukes som referansesystem.

source: contribute in relation to management and carrying out maritime operations
nb: bidra i forbindelse med ledelse og gjennomføring av maritime operasjoner

source: The cadet is also given an introduction to relevant damage mechanisms in order to understand operation and maintenance issues.
nb: Kadetten får og innføring i aktuelle skademekanismer for å forstå drift og vedlikeholdsproblematikk.

source: On completion of the course, you will be able to:
nb: Etter å ha fullført emnet kan kadetten være i stand til å:

source: System theory with discrete Fourier arrays, Fourier transformations and Laplace transformation.
nb: Systemteori med diskrete fourier-rekker, fourier-transformasjoner og Laplace-transformasjon.

source: explain different data models for geographical information and describe relevant quality factors
nb: forklare ulike datamodeller for geografisk informasjon og beskrive relevante kvalitetsfaktorer

source: discuss and problematise the importance of NATO for Norwegian and international security
nb: drøfte og problematisere NATOs betydning for norsk og internasjonal sikkerhet

source: Read and interpret technical drawings, piping diagrams, hydraulics and pneumatics.
nb: Lese og tolke tekniske tegninger, diagrammer for røropplegg, hydraulikk og pneumatikk.

source: The course plan meets the International Convention on Standards of Training, Certification and Watchkeeping for Seafarers, 1978 with amendments
nb: Emneplanen oppfyller den internasjonale konvensjon om normer for opplæring, sertifikater og vakthold for sjøfolk, 1978 med endringer

source: • perform calculations in Octave with algorithms (folding, correlation, modulation, DFT and FFT) for digital signal processing
nb: • utføre beregninger i Octave med algoritmer (folding, korrelasjon, modulasjon, DFT og FFT) for digital signalbehandling

source: The practical part of the course will be carried out at the Norwegian Army Weapons School (HVS) with a focus on the troop commander in combat.
nb: Hensikten med første del er å skape en forståelse for hvilke roller og oppgaver en troppssjef har, samt konteksten for disse.Den praktiske delen av emnet vil gjennomføres ved Hærens våpenskole (HVS) med fokus på troppssjefen i strid.

source: Students will also learn 3D modelling and road design using a CAD program (Autodesk Civil3D).
nb: Studentene vil også lære seg 3D modellering og prosjektering av veier med et digital tegneprogram (Autodesk Civil3D).

source: It will further develop the knowledge of, and proficiency in, English of the cadets, while also serving as a space for reflection for the topics of the course.
nb: Det skal videreutvikle kadettenes kunnskap om og ferdigheter i engelsk, samtidig som det fungerer som et refleksjonsrom for emnets tema.

source: scientific theory and methodology, the Armed Forces’ service personnel in war and peace and be able to identify the strengths and weaknesses of these.
nb: vitenskapelig teori og metode, Forsvarets freds- og krigsstabstjeneste og kunne forstå styrker og svakheter ved disse.

source: The expected workload is approximately 16 hours of work per week (lectures, problem solving, project work, independent study).
nb: Det forventes ca. 16 timers arbeidsinnsats pr. uke (forelesning, oppgaveløsning, prosjekt, selvstudium) av emnet.
